app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
AND `password` = 'f865b53623b121fd34ee5426c792e5c33af8c227'
 LIMIT 1
---
    public function login()
    {
        $username = $this->request->getPost('username');
        $password = sha1($this->request->getPost('password'));

        $user = (new UserModel())
            ->where('username', $username)
            ->where('password', $password)
            ->first();