app/Controllers/JenisUji.php

    public function index()
    {
        $m = new \App\Models\JenisUjiModel();
        $rows = $m->orderBy('id','DESC')->findAll();
---
SELECT *
FROM `jenis_uji`
ORDER BY `id` DESC