app/Controllers/KepalaLab.php

SELECT *
FROM `kepala_lab`
ORDER BY `id` DESC
---
    public function index()
    {
        $m = new KepalaLabModel();
        $data['rows'] = $m->orderBy('id','DESC')->findAll();