app/Controllers/Nota.php

SELECT *
FROM `nota`
ORDER BY `id` DESC
---
    public function index()
    {
        $notaM = new \App\Models\NotaModel();

        $rows = $notaM->orderBy('id','DESC')->findAll();