app/Controllers/Profil.php

    public function index()
    {
        $m = new UserModel();
        $id = session()->get('user_id');
        $row = $m->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

    public function edit()
    {
        $m = new UserModel();
        $id = session()->get('user_id');
        $row = $m->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'