app/Controllers/User.php

    public function index()
    {
        $m = new UserModel();
        $data['rows'] = $m->orderBy('id','DESC')->findAll();
---
SELECT *
FROM `users`
ORDER BY `id` DESC